{
    "posts": [
        {
            "id": 1,
            "title": "Looking for a job in Canada? Canada is looking for you",
            "description": "Canadian Immigration is getting lenient on issuing work visas. Sargun Singh, managing director at Growing Globe Immigration, tells us about the current scenario of Canadian immigration....",
            "category": "Visit",
            "author": "GGI",
            "published_date": "Sept 22, 2023",
            "body": "<p>Canadian Immigration is getting lenient on issuing work visas. Sargun Singh, managing director at Growing Globe Immigration, tells us about the current scenario of Canadian immigration.</p><p><strong>Do you think there are jobs in Canada for foreigners?</strong></p><p>Due to Covid-19 and express entry draws being at an all-time high, this points to the fact that Canada is facing acute shortage of labour in every sector. Canada is working its best to deal with these shortages by giving a lot of approvals for work permits and even has made it easier and faster for employers to get LMIA's to over come the labour shortage problem.</p><p><strong>What are the people in most demand in Canadian labour market right now?</strong></p><p>Job that are in most demand right now include cooks, chefs, host/hostesses, truck drivers, software engineers, human resources, bankers, investors, and people who speak French.</p><p><strong>What the general requirements for people who want to work in Canada?</strong></p><p>As I mentioned in my interview last time, the mandatory requirements are minimum one to two years’ of experience, ability to speak English or French (IELTS/TCF) and appropriate degree in their areas of profession.</p>",
            "image": "/Assets/img/blogs/blog_1.jpg"
        },
        {
            "id": 2,
            "title": "This summer, Canada is looking for 500,000 newcomers",
            "description": "The world is once again ready to travel, and Canada is looking for temporary foreign workers, immigrants, international students, and a diversity of other people.",
            "category": "Visit",
            "author": "GGI",
            "published_date": "Jun 12, 2023",
            "body": "<p>The world is once again ready to travel, and Canada is looking for temporary foreign workers, immigrants, international students, and a diversity of other people.</p><p>In May 2022, the number of job openings in Canada reached a record high of 1,050,100. The job vacancy rate, which compares the number of vacant positions to the number of vacant and filled positions, is 5.9 percent.</p><p>As a result, Canada is actively seeking skilled workers from all over the world. It is the best time to apply for a job in Canada. However, you should be certain that you are applying with the right people. Hiring someone who has dealt with applications before, has a high success rate, and is familiar with the procedures is preferable to hiring someone whose inexperience could result in your application being rejected.</p><p>In an interview, Mr. Vinay Sachdeva, Regulated Canadian Immigration Consultant and founder of Growing Globe Immigration, and Mr. Sargun Singh, Executive Director, clarify critical facts and processes about the Canada immigration process and fees.</p><p><strong>1. What types of jobs are currently in demand in Canada for which UAE residents can apply?</strong></p><p>Canada is currently facing a labour shortage of over one million people. Truck drivers, hospitality, nurses, public support workers, physiotherapists, doctors, farm labour, administrators, manufacturing unit labour, and CNC operators are among the most in-demand jobs for UAE residents.</p><p><strong>2. What are the other immigration programs in Canada?</strong></p><p>There are several ways to immigrate to Canada. In fact, there are over a hundred different ways to apply, allowing multiple skill groups to apply to a specific program. Express Entry, Provincial Nominee Programs, Atlantic Immigration Program, Rural and Northern Immigration Pilot, Home Support Workers, Investments, and other programs are among them.</p><p><strong>3. What are the program's eligibility requirements?</strong></p><p>Canadian immigration focuses on four key factors. Age, education, language assessment, and work experience are all factors to consider. These factors are graded in terms of points, and the points determine your eligibility for various programs. You are welcome to come to our office and have your eligibility checked.</p><p><strong>4. What is the cost of obtaining a work permit or Permanent Residency in Canada?</strong></p><p>To obtain a work permit or permanent residence in Canada, you must have a genuine job offer. The process of obtaining a work permit or permanent residency can cost between AED 45,000 and AED 100,000.</p>",
            "image": "/Assets/img/blogs/blog_2.jpg"
        },
        {
            "id": 3,
            "title": "Reasons for Refusal from Canada",
            "description": "Refusal of a Canada visa is the biggest obstacle for individuals who want to study, work, and settle in Canada...",
            "category": "Case Solution",
            "author": "GGI",
            "published_date": "Dec 5, 2022",
            "body": "<p><strong>Refusal of a Canada visa is the biggest obstacle for individuals who want to study, work, and settle in Canada. Numerous applicants seeking entry to Canada are denied visas each year. There are different reasons your Canadian visa application could be denied.&nbsp;</strong></p><p><br></p><p><strong>So without further ado, let's look at the top five reasons why Canada denies visa applications.</strong></p><p><br></p><p><strong>1. FAILURE TO PROVIDE ENOUGH SUPPORTING DOCUMENTS When applying for a Canadian visa, applicants will be required to submit supporting documents demonstrating that they have not provided false information. Students applying for a study permit, for instance, are required to submit a copy of their degree and transcripts. Professionals, on the other hand, must submit a reference letter detailing their work experience, hours worked, and responsibilities when applying for a work visa to Canada. Your visa could be denied if you don't provide enough evidence to back up your claims.</strong></p><p><br></p><p><strong>2. INSUFFICIENT EVIDENCE TO PROVE YOU CAN SUPPORT YOURSELF FINANCIALLY&nbsp;&nbsp;&nbsp;</strong></p><p><strong>Whether you are going to Canada for studying, working, or traveling, you will need to provide sufficient proof that you will not be a liability to Canada. You will be required to demonstrate your ability to support yourself and any accompanying family members during your stay in Canada. Your Canadian visa application may be denied if you are unable to provide the necessary documentation to support your claim. Every international student applying for a study visa to Canada must demonstrate their financial stability. They can achieve this by offering: If they have transferred money to Canada, evidence of a Canadian bank account in their name, a student or education loan from a bank, a Guaranteed Investment Certificate (GIC) from a participating Canadian financial institution, and proof that they have paid tuition and housing fees. Students applying for a student visa to Canada can check here how much they need to live on.</strong></p><p><br></p><p><strong>3. Inability to demonstrate your intention to return to your home country&nbsp;</strong></p><p><strong>When applying for a tourist visa or student visa, applicants must keep in mind that the visa is only temporary and has an expiration date. As a result, applicants are required to provide sufficient evidence of their intention to return to their home nation. They will not remain in Canada after their visa expires if they provide evidence. A visa official might dismiss your application on the off chance that he is unconvinced that you will get back to your country toward your approved stay's end. You can provide certified translations of lease agreements for your property to demonstrate your intention to return to your home nation. Let's say you're a worker traveling to Canada as a tourist. If that's the case, you can provide an employment letter stating that you are a permanent employee of the company. You can also provide documentation stating the anticipated return date to your employment.</strong></p><p><br></p><p><strong>4. Lack of evidence indicating good health:</strong></p><p><strong>&nbsp;Applicants who intend to stay in Canada for at least six months are required to undergo a medical examination. A medical exam may or may not be required for those who stay for less than six months. It depends on what they intend to accomplish. The purpose of these medical examinations is to ensure that the applicant: Does not have an infectious disease that is currently active, such as syphilis or tuberculosis, which can pose a threat to public health. Do not experience a loss of physical and mental abilities, unpredictability, or violent behavior, which can pose a threat to public safety. If the applicant is unable to pass the medical exam and demonstrate that he is in good health, his visa may be denied.</strong></p><p><br></p><p><strong>5. Moving on to the next reason why a visa was denied, the visa officer was not convinced that you intended to visit Canada. It stems from the applicant's inability to demonstrate to visa officers that he intends to travel to Canada. Immigration authorities require confirmation that your travel plans to Canada are legal and constructive. You'll need to show that you won't stay too long and are only visiting for tourism like to attend a conference or meet your family. Let's say the visa officer doesn't like your reason for going to Canada. He might deny your visa application to Canada in that case. Your previous travel experiences, such as overstaying in another country, may also have an impact on his decision.&nbsp;</strong></p><p><br></p><p><strong>Conclusion: Rejecting a visa can discourage applicants and make it more difficult to apply for another visa in Canada. These are the top five reasons for Canada visa refusal, though there are many other possible explanations. Therefore, the takeaway is to keep them in mind when you apply for your visa at the following time. If you want to reapply for a visa, you can get assistance from our skilled immigration consultant to avoid any problems with the application process.</strong></p>",
            "image": "/Assets/img/blogs/blog_8.jpg"
        },
        {
            "id": 4,
            "title": "Express Entry Score",
            "description": "Before kickstarting with the why's and hows, let's try to fathom what CRS score is...",
            "category": "Permanent Residency",
            "author": "GGI",
            "published_date": "Nov 29, 2022",
            "body": "<p><strong>WHY IS THE CRS SCORE FOR EXPRESS ENTRY DECREASING?</strong></p><p><br></p><p><strong>Before kickstarting with the why’s and hows, let's try to fathom what CRS score is and how important of a role it plays. The Express Entry Comprehensive Ranking System (CRS) score is used to rank you among hundreds of thousands of people awaiting an Invitation to Apply (ITA) for permanent residency in the Express Entry pool.&nbsp;</strong></p><p><br></p><p><strong>No minimum CRS score is required to be included in the Express Entry pool. All you need is to be eligible for one of the 3 immigration programs that use Express Entry; Canadian Experience Class, Federal Skilled Worker, and Federal Skilled Trades (FST). However, since Express Entry is a points-based system, a higher CRS score means a higher chance of immigrating to Canada.</strong></p><p><br></p><p><strong>It’s used to assess your:</strong></p><p><br></p><ol><li><p><strong>skills</strong></p></li><li><p><strong>education</strong></p></li><li><p><strong>language ability</strong></p></li><li><p><strong>work experience</strong></p></li><li><p><strong>other factors</strong></p></li></ol><p><br></p><p><strong>Since the start of all-program draws on July 6th, the CRS score has been steadily declining, as we have observed with prior Express Entry draws. Since every program attracts applications, 7,500 applicants have received ITAs; this number is anticipated to rise.</strong></p><p><br></p><p><strong>Each draw has seen an increase in the number of candidates invited, although the CRS cut-off score has continuously decreased as the backlog of applications in the system is being processed. A 9-point drop from 525 to 516 in the previous draw was seen in the most recent draw. In the 230th draw, ITAs were awarded to an extra 2,750 applicants.</strong></p><p><br></p><p><strong>The following draws are anticipated to see a further decline in the CRS score. Canada will start accepting candidates based on merit starting in the first quarter of 2023.</strong></p><p><br></p><p><strong>The immigration minister will be able to invite candidates based on groupings rather than just CRS ratings under Bill C-19, which was unveiled earlier this year. Combinations of work experience in a sought-after occupation or set of occupations, linguistic ability, and educational background may be grouped together. The CRS cut-off is expected to be substantially lower compared to the general draws that we have been witnessing lately because candidates will be judged against those in their group rather than the whole Express Entry pool.</strong></p>",
            "image": "/Assets/img/blogs/blog_5.jpg"
        },
        {
            "id": 5,
            "title": "TEER System",
            "description": "New Canadian TEER System The new NOC system (TEER) was announced in 2020 and made public at the beginning of 2021.TEER, or training...",
            "category": "Permanent Residency",
            "author": "GGI",
            "published_date": "Nov 29, 2022",
            "body": "<p><br></p><p><strong>New Canadian TEER System The new NOC system (TEER) was announced in 2020 and made public at the beginning of 2021.TEER, or training, education, experience, and responsibility classification, is the name of the new system. By the middle of early 2022, we can anticipate that IRCC will start implementing this change. The National Occupational Classification (NOC) system undergoes major structural revisions every ten years, which is why this change is taking place. As a result of this change, information from numerous relevant stakeholders and the existing occupational groups is examined.</strong></p><p><strong>Statistics Canada, the IRCC, and job seekers (both domestic and international) would be the primary stakeholders in this change. The TEER classification, or updated system, was developed in response to Canada's current economic climate.</strong></p><p><br></p><p><strong>The NOC is Canada's public word-related reference. It classifies employment activities in Canada to help understand how the Canadian labor market is structured, run government programs, encourage skill development, conduct research, and help Canada manage its immigration and foreign worker programs.</strong></p><p><strong>Every ten years, the federal government conducts a comprehensive review of the NOC. Consequently, the NOC is updated to reflect the Canadian labor market and economic changes. Statistics Canada and Employment and Social Development Canada (ESDC) launched NOC 2021 in September.NOC 2021 is the climax of an extensive interaction that incorporates a thorough review, investigation, and assessment of the Canadian economy.</strong></p><p><strong>Currently, NOC 2016 is used by Employment and Social Development Canada (ESDC), Immigration, Refugees and Citizenship Canada (IRCC), and Canada's provinces and territories to manage immigration and foreign worker programs. However, IRCC stated that NOC 2021 will be implemented in the fall of 2022 by both IRCC and ESDC. The federal government wants to give stakeholders, like people applying for immigration, more time to understand how NOC 2021 might affect them.</strong></p><p><br></p><p><strong>Its effect on immigrants and foreign workers NOC 2021 will have little to no effect on applications from immigrants and foreign workers.This is because their work experience will continue to meet the eligibility requirements for their preferred immigration or foreign worker program, despite changes to the NOC.However, some candidates will benefit from the changes while others will suffer.For instance, candidates may now be eligible for additional programs if their employment experience has changed.Alternately, others might find that they are as of now not qualified for a similar explanation.</strong></p><p><strong>Applications may be affected in a variety of ways at this time.Stakeholders will have to wait for IRCC and ESDC to provide additional details.The TEER system is taking the place of the skill type model, as stated by Statistics Canada, for two primary reasons.To begin, the TEER system aims to make it clear how much education and experience are required to work in a particular field.Second, Statistics Canada believes that the skill type approach leads to inaccurate distinctions between occupations with low and high levels of skill.Stakeholders should have a better understanding of the number of skills required for each job when TEER is implemented.</strong></p><p><br></p>",
            "image": "/Assets/img/blogs/blog_7.jpg"
        },
        {
            "id": 6,
            "title": "OINP",
            "description": "One of the Employer Job Offer streams of the Ontario Immigrant Nominee Program (OINP), a Provincial...",
            "category": "Work",
            "author": "GGI",
            "published_date": "Nov 22, 2022",
            "body": "<p><strong>One of the Employer Job Offer streams of the Ontario Immigrant Nominee Program (OINP), a Provincial Nominee Program (PNP) run by the province of Ontario, is for international students. Foreign nationals with completed Canadian degrees and job offers from Ontario employers are the focus of the International Students stream.</strong></p><p><br></p><p><strong>Foreign workers with a job offer in a skilled occupation can apply to live and work permanently in Ontario through the Employer Job Offer: Foreign Worker stream.</strong></p><p><br></p><p><strong>Your employment offer must be in a skilled occupation at the National Occupational Classification's Skill Type 0 or Skill Level A or B. (NOC). Foreign employees both inside and outside of Canada are eligible for this stream.</strong></p><p><br></p><p><strong>Prerequisites for job offers</strong></p><p><strong>You must have a job offer from an employer in Ontario that satisfies the criteria listed below in order to be eligible under the Employer Job Offer: Foreign Worker stream.</strong></p><p><strong>1. Consistent and full-time</strong></p><p><strong>The offered position must be full-time and permanent.</strong></p><p><strong>Full-time employment requires at least 1,560 hours of the work year and 30 hours of paid work per week.</strong></p><p><strong>A permanent position must have no expiration date (also known as an indeterminate duration). Seasonal and/or contract-based job offers are not eligible.</strong></p><p><br></p><p><strong>2. Qualifying profession</strong></p><p><strong>The position being offered must be in a skilled occupation at the National Occupational Classification's Skill Type 0 or Skill Levels A or B. (NOC).</strong></p><p><br></p><p><strong>3. Median hourly pay</strong></p><p><strong>The salary for the position must be at least as high as the median wage for that occupation in the particular region of Ontario where you will be working.</strong></p><p><strong>4. The position is crucial to the employer's operations.</strong></p><p><strong>The role must be urgently required by the operations of your employer. This means that the position must be urgently needed in order to maintain or expand current business activity, and the employment offer must be compatible with your employer's current business operations.</strong></p><p><br></p><p><strong>5. Have a job in Ontario</strong></p><p><strong>The majority of the work you complete while holding the employment offer must take place in Ontario.</strong></p>",
            "image": "/Assets/img/blogs/blog_6.jpg"
        },
        {
            "id": 7,
            "title": "case study",
            "description": "Growing Globe Immigration has been known for years now...",
            "category": "Case Solution",
            "author": "GGI",
            "published_date": "Nov 08, 2022",
            "body": "<p><strong>Growing Globe Immigration has been known for years now for successfully handling those cases where things don’t seem like a cakewalk. The expertise of each member of the team is what helps the company to take up such cases and reach victorious heights.</strong></p><p><br></p><p><strong>Before we commence with the case study, let’s brief ourselves in regards to what Human capital priorities are for a better understanding of the case. The case was a complex one and to fathom how it got cleared through the embassy is something that would astound you. This case too was one of a kind.&nbsp;</strong></p><p><br></p><p><strong>Human Capital Priorities:&nbsp;</strong></p><p><br></p><p><strong>The most well-liked stream for Ontario Immigration is the Human Capital Priorities Stream, which is part of the Stream Category of the Ontario Immigration Nominee Program (OINP). In line with Canada, Express Entry System is this stream. Ontario's Human Capital Priorities Stream identifies in the Express Entry pool those eligible foreign-skilled workers who have the necessary work experience, educational credentials, language proficiency, and another potential that would allow them to establish themselves economically and settle in Ontario.</strong></p><p><br></p><p><strong>To realise their dream, all aspiring immigrants from Ontario must be accepted into the Canada Express Entry pool either through the Federal Skilled Worker Class or the Canadian Experience Class. Direct applications are not accepted for this stream</strong></p><p><br></p><p><strong>Actually, based on their Express Entry Profile, they must get a Notification of Interest (NOI) from the Ontario Provincial Nominee Program. As part of its examination of the Express Entry Pool, the OINP identifies potential applicants with at least 400 points under the Comprehensive Ranking System (CRS).</strong></p><p><br><br></p><p><strong>Case Details:</strong></p><p><strong>The age of the applicant is 40. Has done a master's and is married. His wife was the main applicant. They have relatives in Canada which acted as a plus point but age was our major concern. He is an IT specialist and the CRS score was 416. Due to the nomination, her score went up to 600. In spite of the factors which weren’t very much in favor, the team of Growing Globe Immigration was able to provide her with direct PR.&nbsp;</strong></p><p><br></p><p><strong>It wasn’t a smooth ride, but it was not impossible either. We at Growing Globe Immigration know the potential of each case and it’s the experience and determination that have helped us resolve cases that were discarded by many in the past.&nbsp;</strong></p><p><br></p><p><strong>This scenario has been described to demonstrate to you that we are capable of resolving your case and obtaining your desired outcome. We welcome and invite our clients to be a part of the Growing Globe Immigration - GGI family and value each of them greatly. The GGI team tries to forge close bonds with them. We abide by the saying, \"Your dream is our responsibility.\" This is why we put a lot of effort into helping you achieve your dream of relocating to Canada.</strong></p><p><br></p>",
            "image": "/Assets/img/blogs/blog_4.jpg"
        },
        {
            "id": 8,
            "title": "growing globe immigration",
            "description": "Growing Globe Immigration provides our clients with a variety of immigration options...",
            "category": "Marketing",
            "author": "GGI",
            "published_date": "Jan 11, 2022",
            "body": "<p><strong>INTRODUCTION - GROWING GLOBE IMMIGRATION</strong></p><p><strong>Growing Globe Immigration provides our clients with a variety of immigration options that are most suited to their needs. Our company's founder, Mr. Vinay Sachdeva, is a Canadian immigrant who is a registered immigration consultant. He is committed to assisting his clients in realising their ambition of moving to Canada to live, work, study, invest, or travel there. He desires to aid individuals from all around the world in immigrating to Canada, working with Mr. Sargun Singh. Growing Globe is proud to be governed by the Immigration Consultants of Canada Regulatory Council because we uphold justice, ethics, and ideals (ICCRC).</strong></p><p><br></p><p><strong>Canada is the nation where dreams come true. Growing Globe Immigration is a group of incredibly bright and diligent individuals who value their clients' needs above all else. Our executive team possesses the expertise, zeal, and dedication needed to succeed. In the past, we have contributed to bettering lives through our commitment to developing cutting-edge products and investing in the business and its personnel.</strong></p><p><br></p><p><strong>Growing Globe Immigration was founded in the year 2019. It has not been many years since the foundation has been laid but the impact of the company’s work is immeasurable. The success rate of the company has reached heights and is continuing to do so with the hard work and consistency of our team members, along with the trust of our clients in us which means the most.&nbsp;</strong></p><p><br></p><p><strong>PR with a job offer and without, super visa, Pnp’s, express entry and visit visa, everything mentioned here has success 99.9% success rate because Growing Globe Immigration believes in transparency, which leads to expected results which is a success. This is the reason behind the expansion of Growing Globe Immigration, our success rate, and Canada is one of the best countries to live in. You dream, we will work on it. </strong></p>",
            "image": "/Assets/img/blogs/blog_3.jpg"
        }
    ]
}
